Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
/*  ============================================================
    DUAL-MODE OBSTACLE-AVOIDING + RC WEB CAR
    ESP32  |  TB6612 x2  |  Servo  |  HC-SR04  |  IR  |  Buzzer
    ============================================================
    MODE A  –  Obstacle Avoidance (autonomous, slow speed)
    MODE B  –  RC Web Control     (WiFi browser joystick, fast)
    How to switch modes
    -------------------
    1. Connect to the ESP32's WiFi AP ("GhostDrive") or router
    2. Open http://<IP>/ in your phone or computer browser
    3. Enjoy the premium futuristic Glassmorphism Control Panel!
    ============================================================ */
#include <Arduino.h>
#include <ESP32Servo.h>
#include <WiFi.h>
#include <WebServer.h>
#include <WebSocketsServer.h>
// ─── WiFi Configuration ──────────────────────────────────────
#define WIFI_AP_MODE true  // true = creates own hotspot, false = connects to router
const char* WIFI_SSID = "GhostDrive";
const char* WIFI_PASS = "12345678";
WebServer server(80);
WebSocketsServer webSocket = WebSocketsServer(81);
// ─── Mode ────────────────────────────────────────────────────
enum CarMode { MODE_OA, MODE_RC, MODE_GESTURE, MODE_FOLLOW };
CarMode carMode = MODE_OA;   // default: OA on boot
// ─── Pin Mapping ─────────────────────────────────────────────
// Left TB6612 (two motors on left side)
const int L_AIN1 = 16, L_AIN2 = 17, L_PWMA = 14;
const int L_BIN1 = 19, L_BIN2 = 21, L_PWMB = 22;
// Right TB6612 (two motors on right side)
const int R_AIN1 = 23, R_AIN2 = 25, R_PWMA = 26;
const int R_BIN1 = 32, R_BIN2 = 33, R_PWMB = 13;
const int STBY_PIN   = 27;
const int SERVO_PIN  =  4;
const int TRIG_PIN   =  5;
const int ECHO_PIN   = 18;   // level-shift to 3.3 V!
const int IR_PIN     = 34;   // analog input-only
const int BUZZER     = 15;
// ─── Motor PWM (LEDC Channels) ───────────────────────────────
const int PWM_FREQ     = 18000; // quiet high frequency
const int PWM_RES_BITS = 10;    // 0..1023
const int PWM_MAX      = (1 << PWM_RES_BITS) - 1;
// Core v2.x Channel numbers (Ignored on Core v3.x)
const int CH_L_PWMA = 0;
const int CH_L_PWMB = 1;
const int CH_R_PWMA = 2;
const int CH_R_PWMB = 3;
// ─── Per-motor inversion ──────────────────────────────────────
bool L_A_INVERT = true;
bool L_B_INVERT = false;
bool R_A_INVERT = true;
bool R_B_INVERT = false;
// ─── Speed constants ──────────────────────────────────────────
const int OA_SPEED      = 380;   // OA forward (0-1023) - Reduced for safety
const int OA_TURN       = 280;   // OA pivot - Reduced for safety
const int OA_REVERSE    = 320;   // OA reverse - Reduced for safety
const int RC_SPEED_DEF  = 800;   // RC default speed (faster)
const int RC_TURN_DEF   = 650;   // RC default pivot
// RC runtime speed (changed by slider)
int rcSpeed = RC_SPEED_DEF;
// ─── OA Behaviour ─────────────────────────────────────────────
const int SAFE_DIST_CM  = 30;
const int CLEAR_DIST_CM = 18;
const int TURN_ANGLE_L  = 150;
const int TURN_ANGLE_C  =  90;
const int TURN_ANGLE_R  =  30;
const int REVERSE_MS    = 300;
const int PIVOT_MS      = 260;
const int IR_THRESHOLD  = 1600;
// ─── RC state ────────────────────────────────────────────────
int  rcServoAngle = 90;
bool rcHornOn     = false;
char rcCmd[4]     = "S";  // Drive command: F, B, L, R, FL, FR, BL, BR, S
// ─── Telemetry Globals ────────────────────────────────────────
volatile long lastDistance = 999;
volatile int lastIR = 4095;
int currentServoAngle = 90;
volatile long dL_dist = 999;
volatile long dC_dist = 999;
volatile long dR_dist = 999;
// ─── Actuator Globals ─────────────────────────────────────────
Servo scanServo;
// ─── Human Follower state ────────────────────────────────────
int followAngle = 90;
bool followFound = false;
int followSweepDir = 8;
unsigned long lastFollowTime = 0;
unsigned long lostFollowTime = 0;
// ─────────────────────────────────────────────────────────────
//  MOTOR DRIVER HELPERS (Compatible with Core v2.x and v3.x)
// ─────────────────────────────────────────────────────────────
void writeChannel(bool forward, int AIN1, int AIN2, int pwmPin, int pwmCh, int pwmVal, bool invert) {
  bool f = invert ? !forward : forward;
  digitalWrite(AIN1, f ? HIGH : LOW);
  digitalWrite(AIN2, f ? LOW  : HIGH);
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
  ledcWrite(pwmPin, pwmVal);
#else
  ledcWrite(pwmCh, pwmVal);
#endif
}
void setSide(int speed,
             int AIN1_A, int AIN2_A, int PWM_A_pin, int PWM_A_ch, bool INV_A,
             int AIN1_B, int AIN2_B, int PWM_B_pin, int PWM_B_ch, bool INV_B) {
  int mag = abs(speed);
  if (mag > PWM_MAX) mag = PWM_MAX;
  bool fwd = (speed >= 0);
  writeChannel(fwd, AIN1_A, AIN2_A, PWM_A_pin, PWM_A_ch, mag, INV_A);
  writeChannel(fwd, AIN1_B, AIN2_B, PWM_B_pin, PWM_B_ch, mag, INV_B);
}
void driveLeft (int s){ setSide(s, L_AIN1, L_AIN2, L_PWMA, CH_L_PWMA, L_A_INVERT, L_BIN1, L_BIN2, L_PWMB, CH_L_PWMB, L_B_INVERT); }
void driveRight(int s){ setSide(s, R_AIN1, R_AIN2, R_PWMA, CH_R_PWMA, R_A_INVERT, R_BIN1, R_BIN2, R_PWMB, CH_R_PWMB, R_B_INVERT); }
void stopAll() {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
  ledcWrite(L_PWMA, 0); ledcWrite(L_PWMB, 0);
  ledcWrite(R_PWMA, 0); ledcWrite(R_PWMB, 0);
#else
  ledcWrite(CH_L_PWMA, 0); ledcWrite(CH_L_PWMB, 0);
  ledcWrite(CH_R_PWMA, 0); ledcWrite(CH_R_PWMB, 0);
#endif
}
void forward   (int s){ driveLeft(+s); driveRight(+s); }
void reverse   (int s){ driveLeft(-s); driveRight(-s); }
void pivotLeft (int s){ driveLeft(-s); driveRight(+s); }
void pivotRight(int s){ driveLeft(+s); driveRight(-s); }
// ─────────────────────────────────────────────────────────────
//  SENSOR / ACTUATOR HELPERS
// ─────────────────────────────────────────────────────────────
void beep(int ms) {
  digitalWrite(BUZZER, HIGH);
  delay(ms);
  digitalWrite(BUZZER, LOW);
}
long singlePingCM(unsigned long timeout_us = 20000UL) {
  digitalWrite(TRIG_PIN, LOW);  delayMicroseconds(2);
  digitalWrite(TRIG_PIN, HIGH); delayMicroseconds(10);
  digitalWrite(TRIG_PIN, LOW);
  unsigned long dur = pulseIn(ECHO_PIN, HIGH, timeout_us);
  return dur == 0 ? 9999 : dur / 58;
}
long distanceCM() {
  const int N = 5;
  long d[N];
  for (int i = 0; i < N; i++) { d[i] = singlePingCM(); delay(8); }
  for (int i = 0; i < N-1; i++)
    for (int j = i+1; j < N; j++)
      if (d[j] < d[i]) { long t = d[i]; d[i] = d[j]; d[j] = t; }
  return d[N/2];
}
void aimServo(int angle, bool wait = true) {
  if (angle != currentServoAngle) {
    scanServo.write(angle);
    currentServoAngle = angle;
    if (wait) {
      delay(150); // delay only when waiting is needed (avoid blocking RC loop)
    }
  }
}
int chooseBestTurn() {
  aimServo(TURN_ANGLE_L, true); dL_dist = distanceCM();
  aimServo(TURN_ANGLE_R, true); dR_dist = distanceCM();
  aimServo(TURN_ANGLE_C, true); dC_dist = distanceCM();
  return (dL_dist >= dR_dist) ? +1 : -1;
}
void applyRcCmd(const char* cmd, int spd) {
  int t = spd * 75 / 100; // soft turn speed coefficient
  if      (strcmp(cmd, "F")  == 0) { forward(spd); }
  else if (strcmp(cmd, "B")  == 0) { reverse(spd); }
  else if (strcmp(cmd, "L")  == 0) { pivotLeft(t); }
  else if (strcmp(cmd, "R")  == 0) { pivotRight(t); }
  else if (strcmp(cmd, "FL") == 0) { driveLeft(spd); driveRight(t); }
  else if (strcmp(cmd, "FR") == 0) { driveLeft(t);   driveRight(spd); }
  else if (strcmp(cmd, "BL") == 0) { driveLeft(-t);  driveRight(-spd); }
  else if (strcmp(cmd, "BR") == 0) { driveLeft(-spd);driveRight(-t); }
  else                             { stopAll(); }
}
void webSocketEvent(uint8_t num, WStype_t type, uint8_t * payload, size_t length) {
  switch(type) {
    case WStype_DISCONNECTED:
      Serial.printf("[%u] Disconnected!\n", num);
      break;
    case WStype_CONNECTED: {
      IPAddress ip = webSocket.remoteIP(num);
      Serial.printf("[%u] Connected from %s\n", num, ip.toString().c_str());
      break;
    }
    case WStype_TEXT: {
      String msg = String((char*)payload);
      if (msg.startsWith("g:")) {
        int colon1 = msg.indexOf(':', 2);
        if (colon1 != -1) {
          String cmd = msg.substring(2, colon1);
          int speed = msg.substring(colon1 + 1).toInt();
          if (carMode == MODE_GESTURE) {
            applyRcCmd(cmd.c_str(), speed);
          }
        }
      } else if (msg.startsWith("cmd:")) {
        String cmd = msg.substring(4);
        if (carMode == MODE_RC) {
          strlcpy(rcCmd, cmd.c_str(), sizeof(rcCmd));
        }
      } else if (msg.startsWith("speed:")) {
        int pct = msg.substring(6).toInt();
        pct = constrain(pct, 10, 100);
        rcSpeed = (int)(RC_SPEED_DEF * pct / 100);
      } else if (msg.startsWith("servo:")) {
        rcServoAngle = constrain(msg.substring(6).toInt(), 0, 180);
      } else if (msg.startsWith("horn:")) {
        rcHornOn = (msg.substring(5) == "1");
      } else if (msg.startsWith("mode:")) {
        String m = msg.substring(5);
        stopAll();
        strlcpy(rcCmd, "S", sizeof(rcCmd));
        if (m == "rc") {
          carMode = MODE_RC;
          beep(80);
        } else if (m == "gesture") {
          carMode = MODE_GESTURE;
          beep(80);
        } else if (m == "follow") {
          carMode = MODE_FOLLOW;
          beep(80);
        } else {
          carMode = MODE_OA;
          beep(80); delay(80); beep(80);
          rcServoAngle = TURN_ANGLE_C;
        }
      }
      break;
    }
    default:
      break;
  }
}
void handleRoot() {
  String page = R"rawhtml(
<!DOCTYPE html>
<html>
<head>
  <meta charset='UTF-8'>
  <meta name='viewport' content='width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no'>
  <title>GHOST DRIVE // SCANNER DECK</title>
  <link href="https://fonts.googleapis.com/css2?family=Outfit:wght@400;600;700;800&family=JetBrains+Mono:wght@700&display=swap" rel="stylesheet">
  <style>
    :root {
      --bg-color: #06070d;
      --card-bg: rgba(16, 18, 35, 0.55);
      --card-border: rgba(255, 255, 255, 0.05);
      --accent-primary: #6366f1; /* Indigo for RC */
      --accent-primary-glow: rgba(99, 102, 241, 0.25);
      --accent-success: #10b981; /* Emerald for Autopilot */
      --accent-success-glow: rgba(16, 185, 129, 0.25);
      --accent-gesture: #06b6d4; /* Cyan for Gesture Control */
      --accent-gesture-glow: rgba(6, 182, 212, 0.25);
      --accent-follow: #a855f7; /* Purple for Human Following */
      --accent-follow-glow: rgba(168, 85, 247, 0.25);
      --accent-danger: #f43f5e; /* Rose for Alerts/Horn */
      --accent-danger-glow: rgba(244, 63, 94, 0.3);
      --text-main: #f9fafb;
      --text-muted: #6b7280;
      
      /* Dynamic theme targets */
      --accent-active: var(--accent-success);
      --accent-active-glow: var(--accent-success-glow);
    }
    
    * {
      box-sizing: border-box;
      margin: 0;
      padding: 0;
      -webkit-tap-highlight-color: transparent;
      user-select: none;
    }
    
    body {
      font-family: 'Outfit', sans-serif;
      background-color: var(--bg-color);
      color: var(--text-main);
      background-image: 
      	radial-gradient(circle at 10% 20%, rgba(99, 102, 241, 0.12) 0%, transparent 40%),
      	radial-gradient(circle at 90% 80%, rgba(16, 185, 129, 0.08) 0%, transparent 40%);
      background-attachment: fixed;
      min-height: 100vh;
      display: flex;
      flex-direction: column;
      align-items: center;
      padding: 16px;
      overflow-x: hidden;
    }
    .app-container {
      width: 100%;
      max-width: 440px;
      display: flex;
      flex-direction: column;
      gap: 16px;
    }
    /* Active theme modifiers */
    .app-container.theme-oa {
      --accent-active: var(--accent-success);
      --accent-active-glow: var(--accent-success-glow);
    }
    .app-container.theme-rc {
      --accent-active: var(--accent-primary);
      --accent-active-glow: var(--accent-primary-glow);
    }
    .app-container.theme-gesture {
      --accent-active: var(--accent-gesture);
      --accent-active-glow: var(--accent-gesture-glow);
    }
    .app-container.theme-follow {
      --accent-active: var(--accent-follow);
      --accent-active-glow: var(--accent-follow-glow);
    }
    /* Header styling */
    .header {
      width: 100%;
      display: flex;
      justify-content: space-between;
      align-items: center;
      padding: 4px 6px;
    }
    
    .logo-area {
      display: flex;
      align-items: center;
      gap: 8px;
    }
    
    .pulse-indicator {
      width: 8px;
      height: 8px;
      background-color: var(--accent-active);
      border-radius: 50%;
      box-shadow: 0 0 8px var(--accent-active);
      transition: all 0.3s ease;
      animation: pulse 1.8s infinite;
    }
    
    @keyframes pulse {
      0% { transform: scale(0.95); opacity: 0.6; }
      50% { transform: scale(1.15); opacity: 1; }
      100% { transform: scale(0.95); opacity: 0.6; }
    }
    
