Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
    .joystick-zone {
      width: 100%;
      height: 180px;
      display: flex;
      align-items: center;
      justify-content: center;
      position: relative;
      touch-action: none;
    }
    
    .joystick-base {
      width: 150px;
      height: 150px;
      background: rgba(30, 35, 60, 0.2);
      border: 1.5px dashed rgba(255, 255, 255, 0.08);
      border-radius: 50%;
      position: relative;
      display: flex;
      align-items: center;
      justify-content: center;
      box-shadow: inset 0 4px 12px rgba(0, 0, 0, 0.3);
    }
    
    .joystick-handle {
      width: 54px;
      height: 54px;
      background: radial-gradient(circle at 30% 30%, #ffffff 0%, var(--accent-active) 85%);
      border-radius: 50%;
      position: absolute;
      cursor: grab;
      box-shadow: 0 8px 20px rgba(0, 0, 0, 0.4), 0 0 15px var(--accent-active-glow);
      transition: background-color 0.3s ease;
      touch-action: none;
    }
    
    .joystick-handle:active {
      cursor: grabbing;
      background: radial-gradient(circle at 30% 30%, #ffffff 0%, #ffffff 100%);
      box-shadow: 0 4px 10px rgba(0,0,0,0.4), 0 0 25px #ffffff;
    }
    /* Sliders and Action Buttons */
    .actions-panel {
      display: flex;
      flex-direction: column;
      gap: 16px;
    }
    
    .btn-horn {
      width: 100%;
      padding: 14px;
      background: rgba(244, 63, 94, 0.08);
      border: 1px solid rgba(244, 63, 94, 0.2);
      border-radius: 16px;
      color: var(--accent-danger);
      font-family: inherit;
      font-size: 11px;
      font-weight: 700;
      letter-spacing: 0.08em;
      cursor: pointer;
      display: flex;
      align-items: center;
      justify-content: center;
      gap: 8px;
      outline: none;
      transition: all 0.15s ease;
    }
    
    .btn-horn svg {
      width: 16px;
      height: 16px;
      fill: none;
      stroke: currentColor;
      stroke-width: 2.2;
    }
    
    .btn-horn:active, .btn-horn.active {
      background: var(--accent-danger);
      border-color: var(--accent-danger);
      color: #ffffff;
      transform: scale(0.97);
      box-shadow: 0 0 16px var(--accent-danger-glow);
    }
    
    .slider-group {
      display: flex;
      flex-direction: column;
      gap: 6px;
    }
    
    .slider-header {
      display: flex;
      justify-content: space-between;
      align-items: center;
      padding: 0 2px;
    }
    
    .slider-title {
      display: flex;
      align-items: center;
      gap: 6px;
      font-size: 9px;
      font-weight: 800;
      letter-spacing: 0.08em;
      color: var(--text-muted);
    }
    
    .slider-icon {
      width: 13px;
      height: 13px;
      fill: none;
      stroke: currentColor;
      stroke-width: 2.2;
    }
    
    .slider-value {
      font-size: 11px;
      font-weight: 700;
      color: var(--accent-active);
      font-family: 'JetBrains Mono', monospace;
      transition: color 0.3s ease;
    }
    
    .range-input-wrap {
      padding: 4px 0;
    }
    
    input[type='range'] {
      -webkit-appearance: none;
      width: 100%;
      height: 5px;
      background: rgba(255, 255, 255, 0.07);
      border-radius: 4px;
      outline: none;
      border: none;
    }
    
    input[type='range']::-webkit-slider-thumb {
      -webkit-appearance: none;
      width: 18px;
      height: 18px;
      border-radius: 50%;
      background: var(--accent-active);
      box-shadow: 0 0 8px var(--accent-active-glow);
      cursor: pointer;
      border: 2.5px solid var(--bg-color);
      transition: transform 0.12s, background-color 0.12s, border-color 0.12s;
    }
    
    input[type='range']::-webkit-slider-thumb:hover {
      transform: scale(1.15);
    }
    
    input[type='range']::-webkit-slider-thumb:active {
      background: #ffffff;
      border-color: var(--accent-active);
      box-shadow: 0 0 12px #ffffff;
    }
    /* D-pad fallback buttons */
    .dpad-btn {
      background: rgba(6, 182, 212, 0.07);
      border: 1.5px solid rgba(6, 182, 212, 0.18);
      border-radius: 12px;
      color: var(--accent-gesture);
      font-size: 18px;
      height: 52px;
      cursor: pointer;
      display: flex;
      align-items: center;
      justify-content: center;
      outline: none;
      font-family: inherit;
      transition: background 0.12s, transform 0.1s;
      touch-action: none;
      -webkit-tap-highlight-color: transparent;
    }
    .dpad-btn:active {
      background: rgba(6, 182, 212, 0.25);
      transform: scale(0.93);
      box-shadow: 0 0 12px rgba(6, 182, 212, 0.3);
    }
    /* RC Transmitter Control Buttons */
    .rc-ctrl-btn {
      background: rgba(99, 102, 241, 0.07);
      border: 1.5px solid rgba(99, 102, 241, 0.22);
      border-radius: 14px;
      color: var(--accent-primary);
      font-size: 20px;
      font-weight: 800;
      height: 72px;
      cursor: pointer;
      display: flex;
      flex-direction: column;
      align-items: center;
      justify-content: center;
      gap: 2px;
      outline: none;
      font-family: inherit;
      transition: background 0.1s, transform 0.08s, box-shadow 0.1s;
      touch-action: none;
      -webkit-tap-highlight-color: transparent;
      user-select: none;
      width: 100%;
    }
    .rc-ctrl-btn small { font-size: 8px; font-weight: 700; letter-spacing: 0.08em; opacity: 0.7; }
    .rc-ctrl-btn:active, .rc-ctrl-btn.pressed {
      background: rgba(99, 102, 241, 0.28);
      transform: scale(0.91);
      box-shadow: 0 0 18px rgba(99, 102, 241, 0.4);
    }
    .rc-stop-btn {
      background: rgba(244, 63, 94, 0.07);
      border-color: rgba(244, 63, 94, 0.22);
      color: var(--accent-danger);
    }
    .rc-stop-btn:active, .rc-stop-btn.pressed {
      background: rgba(244, 63, 94, 0.28);
      box-shadow: 0 0 18px rgba(244, 63, 94, 0.4);
    }
  </style>
</head>
<body>
<div class='app-container theme-oa'>
  
  <!-- Top Header Deck -->
  <header class='header'>
    <div class='logo-area'>
      <span class='pulse-indicator'></span>
      <h1 class='logo-title'>GHOST DRIVE</h1>
    </div>
    <div class='connection-badge' id='conn-badge'>READY</div>
  </header>
  <!-- Radar centerpiece card -->
  <section class='card'>
    <h2 class='card-title'>ACTIVE TELEMETRY SCANNER</h2>
    <div class='radar-wrapper'>
      <canvas id='radar-canvas' width='200' height='200'></canvas>
    </div>
    <div class='metrics-container'>
      <!-- Distance Widget -->
      <div class='metric-widget'>
        <div class='metric-icon-wrap'>
          <svg viewBox='0 0 24 24'><path d='M12 22s8-4 8-10V5l-8-3-8 3v7c0 6 8 10 8 10z'/></svg>
        </div>
        <span class='metric-label'>LIDAR RANGE</span>
        <span class='metric-value' id='val-dist'>-- cm</span>
        <div class='gauge-bar-container'>
          <div class='gauge-bar' id='dist-gauge' style='width: 100%'></div>
        </div>
      </div>
      <!-- Cliff Widget -->
      <div class='metric-widget'>
        <div class='metric-icon-wrap'>
          <svg viewBox='0 0 24 24'><path d='M12 2L2 22h20L12 2zm0 14h.01M12 10v4'/></svg>
        </div>
        <span class='metric-label'>CLIFF SCAN</span>
        <span class='metric-value status-safe' id='val-cliff'>SAFE</span>
        <div class='gauge-bar-container'>
          <div class='gauge-bar' id='cliff-gauge' style='width: 100%'></div>
        </div>
      </div>
      <!-- Vector Widget -->
      <div class='metric-widget'>
        <div class='metric-icon-wrap'>
          <svg viewBox='0 0 24 24'><polygon points='12 2 22 8.5 22 15.5 12 22 2 15.5 2 8.5 12 2'/></svg>
        </div>
        <span class='metric-label'>VECTOR CHN</span>
        <span class='metric-value' id='val-cmd'>STOP</span>
        <div class='gauge-bar-container'>
          <div class='gauge-bar' id='vector-gauge' style='width: 100%'></div>
        </div>
      </div>
    </div>
  </section>
  
  <!-- Sliding Selector Tab -->
  <div class='mode-selector'>
    <button class='mode-tab active' id='tab-oa' onclick='changeMode("oa")'>
      <svg class='tab-icon' viewBox='0 0 24 24'><circle cx='12' cy='12' r='3'/><path d='M12 2v3M12 19v3M4.22 4.22l2.12 2.12M17.66 17.66l2.12 2.12M2 12h3M19 12h3M4.22 19.78l2.12-2.12M17.66 6.34l2.12-2.12'/></svg>
      <span>AUTO</span>
    </button>
    <button class='mode-tab' id='tab-rc' onclick='changeMode("rc")'>
      <svg class='tab-icon' viewBox='0 0 24 24'><rect x='2' y='7' width='20' height='14' rx='3'/><path d='M12 7V3M8 3h8'/><line x1='9' y1='14' x2='9' y2='14'/><line x1='6' y1='14' x2='12' y2='14'/><line x1='9' y1='11' x2='9' y2='17'/><circle cx='15' cy='14' r='1'/></svg>
      <span>RC</span>
    </button>
    <button class='mode-tab' id='tab-gesture' onclick='changeMode("gesture")'>
      <svg class='tab-icon' viewBox='0 0 24 24'><rect x='5' y='2' width='14' height='20' rx='2' ry='2'/><line x1='12' y1='18' x2='12.01' y2='18'/><path d='M17 6c2 1 3 3 3 5s-1 4-3 5'/><path d='M7 6c-2 1-3 3-3 5s1 4 3 5'/></svg>
      <span>TILT</span>
    </button>
    <button class='mode-tab' id='tab-follow' onclick='changeMode("follow")'>
      <svg class='tab-icon' viewBox='0 0 24 24'><path d='M16 21v-2a4 4 0 0 0-4-4H6a4 4 0 0 0-4 4v2'/><circle cx='9' cy='7' r='4'/><path d='M22 9l-3 3 3 3'/></svg>
      <span>FOLLOW</span>
    </button>
    <div class='tab-glider'></div>
  </div>

  <!-- Autonomous Tab Page -->
  <section class='card panel-oa active' id='panel-oa'>
    <h2 class='card-title'>AUTONOMOUS NAVIGATOR</h2>
    <div class='oa-status-msg'>
      Car running in autonomous safety mode. Reduced speeds engaged for maximum reaction windows. Scans will run dynamically at path obstructions.
    </div>
  </section>

  <!-- RC Drive Tab Page -->
  <section class='card panel-rc' id='panel-rc'>
    <h2 class='card-title'>RC TRANSMITTER</h2>
    <!-- Direction pad: 3x3 grid, centre = STOP -->
    <div style='display:grid; grid-template-columns:repeat(3,1fr); gap:10px; max-width:260px; margin:0 auto 18px;'>
      <div></div>
      <button class='rc-ctrl-btn' id='rc-fwd'>&#9650;<br><small>FORWARD</small></button>
      <div></div>
      <button class='rc-ctrl-btn' id='rc-left'>&#9668;<br><small>LEFT</small></button>
      <button class='rc-ctrl-btn rc-stop-btn' id='rc-stop'>&#9632;<br><small>STOP</small></button>
      <button class='rc-ctrl-btn' id='rc-right'>&#9658;<br><small>RIGHT</small></button>
      <div></div>
      <button class='rc-ctrl-btn' id='rc-rev'>&#9660;<br><small>REVERSE</small></button>
      <div></div>
    </div>
    <!-- Horn & sliders -->
    <div class='actions-panel'>
      <button class='btn-horn' id='btn-horn'>
        <svg viewBox='0 0 24 24'><path d='M11 5L6 9H2v6h4l5 4V5z'/><path d='M19.07 4.93a10 10 0 0 1 0 14.14'/><path d='M15.54 8.46a5 5 0 0 1 0 7.07'/></svg>
        <span>TRIGGER HORN</span>
      </button>
      <div class='slider-group'>
        <div class='slider-header'>
          <div class='slider-title'>
            <svg class='slider-icon' viewBox='0 0 24 24'><polygon points='13 2 3 14 12 14 11 22 21 10 12 10 13 2'/></svg>
            <span>RC DRIVE VELOCITY</span>
          </div>
          <span class='slider-value' id='val-speed'>78%</span>
        </div>
        <div class='range-input-wrap'>
          <input type='range' id='slide-speed' min='20' max='100' value='78'>
        </div>
      </div>
      <div class='slider-group'>
        <div class='slider-header'>
          <div class='slider-title'>
            <svg class='slider-icon' viewBox='0 0 24 24'><path d='M1 12s4-8 11-8 11 8 11 8-4 8-11 8-11-8-11-8z'/><circle cx='12' cy='12' r='3'/></svg>
            <span>RADAR DECK SERVO</span>
          </div>
          <span class='slider-value' id='val-servo'>90&deg;</span>
        </div>
        <div class='range-input-wrap'>
          <input type='range' id='slide-servo' min='0' max='180' value='90'>
        </div>
      </div>
    </div>
  </section>

