Electric-Brain/ESP32-Based-Obstacle-Avoiding-Robot-Car/GHOST_DRIVE_DUAL.ino
    // Decay update & draw warning markers
    targetSpots.forEach(t => t.life -= 0.012);
    targetSpots = targetSpots.filter(t => t.life > 0);
    targetSpots.forEach(t => {
      const r = (Math.min(t.dist, 250) / 250) * maxR;  // scaled to 250cm
      const rAngle = t.angle * Math.PI / 180;
      const tx = cx + r * Math.cos(rAngle);
      const ty = cy - r * Math.sin(rAngle);
      
      // Warning obstacle glow ring
      ctx.beginPath();
      ctx.arc(tx, ty, 4, 0, 2 * Math.PI);
      ctx.fillStyle = `rgba(244, 63, 94, ${t.life})`;
      ctx.shadowColor = '#f43f5e';
      ctx.shadowBlur = 8;
      ctx.fill();
      ctx.shadowBlur = 0;
      
      // Pulsing outer halo rings
      ctx.beginPath();
      ctx.arc(tx, ty, 12 * (1 - t.life), 0, 2 * Math.PI);
      ctx.strokeStyle = `rgba(244, 63, 94, ${t.life * 0.45})`;
      ctx.lineWidth = 1.2;
      ctx.stroke();
    });
    requestAnimationFrame(renderRadar);
  };
  
  // IMU canvas indicator bubble drawing
  const drawImuIndicator = (pitch, roll) => {
    const imuCanvas = document.getElementById('imu-canvas');
    if (!imuCanvas) return;
    const imuCtx = imuCanvas.getContext('2d');
    const icx = imuCanvas.width / 2;
    const icy = imuCanvas.height / 2;
    const maxOffset = 50;
    
    imuCtx.clearRect(0, 0, imuCanvas.width, imuCanvas.height);
    
    // Draw outer circle
    imuCtx.strokeStyle = 'rgba(6, 182, 212, 0.15)';
    imuCtx.lineWidth = 2;
    imuCtx.beginPath();
    imuCtx.arc(icx, icy, maxOffset, 0, 2 * Math.PI);
    imuCtx.stroke();
    
    // Draw crosshairs
    imuCtx.strokeStyle = 'rgba(6, 182, 212, 0.05)';
    imuCtx.beginPath();
    imuCtx.moveTo(icx - maxOffset, icy);
    imuCtx.lineTo(icx + maxOffset, icy);
    imuCtx.moveTo(icx, icy - maxOffset);
    imuCtx.lineTo(icx, icy + maxOffset);
    imuCtx.stroke();
    
    // Calculate bubble position based on pitch/roll (clamp between -45 and 45)
    const px = Math.min(Math.max(roll / 45, -1), 1) * maxOffset;
    const py = Math.min(Math.max(-pitch / 45, -1), 1) * maxOffset;
    
    // Draw bubble
    imuCtx.beginPath();
    imuCtx.arc(icx + px, icy + py, 10, 0, 2 * Math.PI);
    imuCtx.fillStyle = 'var(--accent-active)';
    imuCtx.shadowColor = 'var(--accent-active)';
    imuCtx.shadowBlur = 10;
    imuCtx.fill();
    imuCtx.shadowBlur = 0;
  };
  
  // Process device orientation and send packets to server
  const processOrientationData = (pitch, roll) => {
    const now = Date.now();
    if (now - lastGestureTime < 100) return;
    lastGestureTime = now;
    
    let cmd = 'S';
    const deadzone = 10;
    
    const absPitch = Math.abs(pitch);
    const absRoll = Math.abs(roll);
    
    if (absPitch > deadzone || absRoll > deadzone) {
      if (pitch > deadzone && roll > deadzone) cmd = 'FR';
      else if (pitch > deadzone && roll < -deadzone) cmd = 'FL';
      else if (pitch < -deadzone && roll > deadzone) cmd = 'BR';
      else if (pitch < -deadzone && roll < -deadzone) cmd = 'BL';
      else if (pitch > deadzone) cmd = 'F';
      else if (pitch < -deadzone) cmd = 'B';
      else if (roll > deadzone) cmd = 'R';
      else if (roll < -deadzone) cmd = 'L';
    }
    
    let speed = 0;
    if (cmd !== 'S') {
      const maxTilt = Math.min(Math.max(Math.max(absPitch, absRoll), deadzone), 40);
      const pct = (maxTilt - deadzone) / (40 - deadzone);
      const limitPct = parseInt(document.getElementById('slide-speed').value) / 100.0;
      speed = Math.round(350 + (pct * (800 - 350) * limitPct));
    }
    
    sendGestureCmd(cmd, speed);
  };
  
  const startOrientationListener = () => {
    if (imuActive) return;
    imuActive = true;
    imuEventsReceived = false;
    window.addEventListener('deviceorientation', handleDeviceOrientation);
    document.getElementById('btn-imu-toggle').textContent = 'STOP TILT STEERING';
    document.getElementById('btn-imu-toggle').classList.add('active');
    // After 2 seconds, check if any events actually arrived
    setTimeout(() => {
      if (imuActive && !imuEventsReceived) {
        const warn = document.getElementById('imu-warning');
        if (warn) warn.style.display = 'block';
      }
    }, 2000);
  };
  
  const stopOrientationListener = () => {
    if (!imuActive) return;
    imuActive = false;
    imuEventsReceived = false;
    window.removeEventListener('deviceorientation', handleDeviceOrientation);
    document.getElementById('btn-imu-toggle').textContent = 'START TILT STEERING';
    document.getElementById('btn-imu-toggle').classList.remove('active');
    const warn = document.getElementById('imu-warning');
    if (warn) warn.style.display = 'none';
    sendGestureCmd('S', 0);
    drawImuIndicator(0, 0);
  };
  
  const handleDeviceOrientation = (event) => {
    if (!imuActive || document.querySelector('.app-container').classList.contains('theme-gesture') === false) return;
    imuEventsReceived = true;
    // Hide warning if events start coming in
    const warn = document.getElementById('imu-warning');
    if (warn && warn.style.display !== 'none') warn.style.display = 'none';
    const pitch = event.beta;
    const roll = event.gamma;
    document.getElementById('val-pitch').textContent = Math.round(pitch) + '&deg;';
    document.getElementById('val-roll').textContent = Math.round(roll) + '&deg;';
    drawImuIndicator(pitch, roll);
    processOrientationData(pitch, roll);
  };
  
  // Fallback D-pad for when browser blocks DeviceOrientation (e.g. Android Chrome on HTTP)
  const gestureManual = (cmd) => {
    const spdPct = parseInt(document.getElementById('slide-speed').value);
    const speed = cmd === 'S' ? 0 : Math.round(350 + ((spdPct - 20) / 80) * (800 - 350));
    sendGestureCmd(cmd, speed);
  };
  
  const requestOrientationPermission = () => {
    if (imuActive) {
      stopOrientationListener();
      return;
    }
    
    // Check permission logic
    if (typeof DeviceOrientationEvent !== 'undefined' && typeof DeviceOrientationEvent.requestPermission === 'function') {
      DeviceOrientationEvent.requestPermission()
        .then(response => {
          if (response === 'granted') {
            startOrientationListener();
          } else {
            alert('Device orientation permission is required for tilt control.');
          }
        })
        .catch(console.error);
    } else {
      startOrientationListener();
    }
  };
  
